Kakakacarrotcake/bazel_toolchain_atmega/mplab_xc8_compiler/v3.00/pic/include/proc/pic16f13125.h
#define                                 UTH7_bit            _BIT_ACCESS(ADUTHL,7)
// ADUTHH<UTH8>
extern volatile __bit                   UTH8                __at(0xE878);	// @ (0x1D0F * 8 + 0)
#define                                 UTH8_bit            _BIT_ACCESS(ADUTHH,0)
// ADUTHH<UTH9>
extern volatile __bit                   UTH9                __at(0xE879);	// @ (0x1D0F * 8 + 1)
#define                                 UTH9_bit            _BIT_ACCESS(ADUTHH,1)
// ADSTAT<UTHR>
extern volatile __bit                   UTHR                __at(0xE956);	// @ (0x1D2A * 8 + 6)
#define                                 UTHR_bit            _BIT_ACCESS(ADSTAT,6)
// SSP1CON1<WCOL>
extern volatile __bit                   WCOL                __at(0x3C87);	// @ (0x790 * 8 + 7)
#define                                 WCOL_bit            _BIT_ACCESS(SSP1CON1,7)
// SSP1CON1<WCOL1>
extern volatile __bit                   WCOL1               __at(0x3C87);	// @ (0x790 * 8 + 7)
#define                                 WCOL1_bit           _BIT_ACCESS(SSP1CON1,7)
// WDTCON1<WDTCS0>
extern volatile __bit                   WDTCS0              __at(0xC6C);	// @ (0x18D * 8 + 4)
#define                                 WDTCS0_bit          _BIT_ACCESS(WDTCON1,4)
// WDTCON1<WDTCS1>
extern volatile __bit                   WDTCS1              __at(0xC6D);	// @ (0x18D * 8 + 5)
#define                                 WDTCS1_bit          _BIT_ACCESS(WDTCON1,5)
// WDTCON1<WDTCS2>
extern volatile __bit                   WDTCS2              __at(0xC6E);	// @ (0x18D * 8 + 6)
#define                                 WDTCS2_bit          _BIT_ACCESS(WDTCON1,6)
// WDTCON0<WDTPS0>
extern volatile __bit                   WDTPS0              __at(0xC61);	// @ (0x18C * 8 + 1)
#define                                 WDTPS0_bit          _BIT_ACCESS(WDTCON0,1)
// WDTCON0<WDTPS1>
extern volatile __bit                   WDTPS1              __at(0xC62);	// @ (0x18C * 8 + 2)
#define                                 WDTPS1_bit          _BIT_ACCESS(WDTCON0,2)
// WDTCON0<WDTPS2>
extern volatile __bit                   WDTPS2              __at(0xC63);	// @ (0x18C * 8 + 3)
#define                                 WDTPS2_bit          _BIT_ACCESS(WDTCON0,3)
// WDTCON0<WDTPS3>
extern volatile __bit                   WDTPS3              __at(0xC64);	// @ (0x18C * 8 + 4)
#define                                 WDTPS3_bit          _BIT_ACCESS(WDTCON0,4)
// WDTCON0<WDTPS4>
extern volatile __bit                   WDTPS4              __at(0xC65);	// @ (0x18C * 8 + 5)
#define                                 WDTPS4_bit          _BIT_ACCESS(WDTCON0,5)
// WDTTMR<WDTPSCNT16>
extern volatile __bit                   WDTPSCNT16          __at(0xC80);	// @ (0x190 * 8 + 0)
#define                                 WDTPSCNT16_bit      _BIT_ACCESS(WDTTMR,0)
// WDTTMR<WDTPSCNT17>
extern volatile __bit                   WDTPSCNT17          __at(0xC81);	// @ (0x190 * 8 + 1)
#define                                 WDTPSCNT17_bit      _BIT_ACCESS(WDTTMR,1)
// WDTCON0<WDTSEN>
extern volatile __bit                   WDTSEN              __at(0xC60);	// @ (0x18C * 8 + 0)
#define                                 WDTSEN_bit          _BIT_ACCESS(WDTCON0,0)
// WDTTMR<WDTSTATE>
extern volatile __bit                   WDTSTATE            __at(0xC82);	// @ (0x190 * 8 + 2)
#define                                 WDTSTATE_bit        _BIT_ACCESS(WDTTMR,2)
// WDTTMR<WDTTMR0>
extern volatile __bit                   WDTTMR0             __at(0xC83);	// @ (0x190 * 8 + 3)
#define                                 WDTTMR0_bit         _BIT_ACCESS(WDTTMR,3)
// WDTTMR<WDTTMR1>
extern volatile __bit                   WDTTMR1             __at(0xC84);	// @ (0x190 * 8 + 4)
#define                                 WDTTMR1_bit         _BIT_ACCESS(WDTTMR,4)
// WDTTMR<WDTTMR2>
extern volatile __bit                   WDTTMR2             __at(0xC85);	// @ (0x190 * 8 + 5)
#define                                 WDTTMR2_bit         _BIT_ACCESS(WDTTMR,5)
// WDTTMR<WDTTMR3>
extern volatile __bit                   WDTTMR3             __at(0xC86);	// @ (0x190 * 8 + 6)
#define                                 WDTTMR3_bit         _BIT_ACCESS(WDTTMR,6)
// WDTTMR<WDTTMR4>
extern volatile __bit                   WDTTMR4             __at(0xC87);	// @ (0x190 * 8 + 7)
#define                                 WDTTMR4_bit         _BIT_ACCESS(WDTTMR,7)
// WDTCON1<WDTWINDOW0>
extern volatile __bit                   WDTWINDOW0          __at(0xC68);	// @ (0x18D * 8 + 0)
#define                                 WDTWINDOW0_bit      _BIT_ACCESS(WDTCON1,0)
// WDTCON1<WDTWINDOW1>
extern volatile __bit                   WDTWINDOW1          __at(0xC69);	// @ (0x18D * 8 + 1)
#define                                 WDTWINDOW1_bit      _BIT_ACCESS(WDTCON1,1)
// WDTCON1<WDTWINDOW2>
extern volatile __bit                   WDTWINDOW2          __at(0xC6A);	// @ (0x18D * 8 + 2)
#define                                 WDTWINDOW2_bit      _BIT_ACCESS(WDTCON1,2)
// WDTCON1<WINDOW0>
extern volatile __bit                   WINDOW0             __at(0xC68);	// @ (0x18D * 8 + 0)
#define                                 WINDOW0_bit         _BIT_ACCESS(WDTCON1,0)
// WDTCON1<WINDOW1>
extern volatile __bit                   WINDOW1             __at(0xC69);	// @ (0x18D * 8 + 1)
#define                                 WINDOW1_bit         _BIT_ACCESS(WDTCON1,1)
// WDTCON1<WINDOW2>
extern volatile __bit                   WINDOW2             __at(0xC6A);	// @ (0x18D * 8 + 2)
#define                                 WINDOW2_bit         _BIT_ACCESS(WDTCON1,2)
// WPUA<WPUA0>
extern volatile __bit                   WPUA0               __at(0xF468);	// @ (0x1E8D * 8 + 0)
#define                                 WPUA0_bit           _BIT_ACCESS(WPUA,0)
// WPUA<WPUA1>
extern volatile __bit                   WPUA1               __at(0xF469);	// @ (0x1E8D * 8 + 1)
#define                                 WPUA1_bit           _BIT_ACCESS(WPUA,1)
// WPUA<WPUA2>
extern volatile __bit                   WPUA2               __at(0xF46A);	// @ (0x1E8D * 8 + 2)
#define                                 WPUA2_bit           _BIT_ACCESS(WPUA,2)
// WPUA<WPUA3>
extern volatile __bit                   WPUA3               __at(0xF46B);	// @ (0x1E8D * 8 + 3)
#define                                 WPUA3_bit           _BIT_ACCESS(WPUA,3)
// WPUA<WPUA4>
extern volatile __bit                   WPUA4               __at(0xF46C);	// @ (0x1E8D * 8 + 4)
#define                                 WPUA4_bit           _BIT_ACCESS(WPUA,4)
// WPUA<WPUA5>
extern volatile __bit                   WPUA5               __at(0xF46D);	// @ (0x1E8D * 8 + 5)
#define                                 WPUA5_bit           _BIT_ACCESS(WPUA,5)
// WPUC<WPUC0>
extern volatile __bit                   WPUC0               __at(0xF508);	// @ (0x1EA1 * 8 + 0)
#define                                 WPUC0_bit           _BIT_ACCESS(WPUC,0)
// WPUC<WPUC1>
extern volatile __bit                   WPUC1               __at(0xF509);	// @ (0x1EA1 * 8 + 1)
#define                                 WPUC1_bit           _BIT_ACCESS(WPUC,1)
// WPUC<WPUC2>
extern volatile __bit                   WPUC2               __at(0xF50A);	// @ (0x1EA1 * 8 + 2)
#define                                 WPUC2_bit           _BIT_ACCESS(WPUC,2)
// WPUC<WPUC3>
extern volatile __bit                   WPUC3               __at(0xF50B);	// @ (0x1EA1 * 8 + 3)
#define                                 WPUC3_bit           _BIT_ACCESS(WPUC,3)
// WPUC<WPUC4>
extern volatile __bit                   WPUC4               __at(0xF50C);	// @ (0x1EA1 * 8 + 4)
#define                                 WPUC4_bit           _BIT_ACCESS(WPUC,4)
// WPUC<WPUC5>
extern volatile __bit                   WPUC5               __at(0xF50D);	// @ (0x1EA1 * 8 + 5)
#define                                 WPUC5_bit           _BIT_ACCESS(WPUC,5)
// NVMCON1<WR>
extern volatile __bit                   WR                  __at(0xE481);	// @ (0x1C90 * 8 + 1)
#define                                 WR_bit              _BIT_ACCESS(NVMCON1,1)
// NVMCON1<WREN>
extern volatile __bit                   WREN                __at(0xE482);	// @ (0x1C90 * 8 + 2)
#define                                 WREN_bit            _BIT_ACCESS(NVMCON1,2)
// NVMCON1<WRERR>
extern volatile __bit                   WRERR               __at(0xE483);	// @ (0x1C90 * 8 + 3)
#define                                 WRERR_bit           _BIT_ACCESS(NVMCON1,3)
// BAUD1CON<WUE>
extern volatile __bit                   WUE                 __at(0x3891);	// @ (0x712 * 8 + 1)
#define                                 WUE_bit             _BIT_ACCESS(BAUD1CON,1)
// CRCXORL<XOR0>
extern volatile __bit                   XOR0                __at(0xE508);	// @ (0x1CA1 * 8 + 0)
#define                                 XOR0_bit            _BIT_ACCESS(CRCXORL,0)
// CRCXORL<XOR1>
extern volatile __bit                   XOR1                __at(0xE509);	// @ (0x1CA1 * 8 + 1)
#define                                 XOR1_bit            _BIT_ACCESS(CRCXORL,1)
// CRCXORH<XOR10>
extern volatile __bit                   XOR10               __at(0xE512);	// @ (0x1CA2 * 8 + 2)
#define                                 XOR10_bit           _BIT_ACCESS(CRCXORH,2)
// CRCXORH<XOR11>
extern volatile __bit                   XOR11               __at(0xE513);	// @ (0x1CA2 * 8 + 3)
#define                                 XOR11_bit           _BIT_ACCESS(CRCXORH,3)
// CRCXORH<XOR12>
extern volatile __bit                   XOR12               __at(0xE514);	// @ (0x1CA2 * 8 + 4)
#define                                 XOR12_bit           _BIT_ACCESS(CRCXORH,4)
// CRCXORH<XOR13>
extern volatile __bit                   XOR13               __at(0xE515);	// @ (0x1CA2 * 8 + 5)
#define                                 XOR13_bit           _BIT_ACCESS(CRCXORH,5)
// CRCXORH<XOR14>
extern volatile __bit                   XOR14               __at(0xE516);	// @ (0x1CA2 * 8 + 6)
#define                                 XOR14_bit           _BIT_ACCESS(CRCXORH,6)
// CRCXORH<XOR15>
extern volatile __bit                   XOR15               __at(0xE517);	// @ (0x1CA2 * 8 + 7)
#define                                 XOR15_bit           _BIT_ACCESS(CRCXORH,7)
// CRCXORU<XOR16>
extern volatile __bit                   XOR16               __at(0xE518);	// @ (0x1CA3 * 8 + 0)
#define                                 XOR16_bit           _BIT_ACCESS(CRCXORU,0)
// CRCXORU<XOR17>
extern volatile __bit                   XOR17               __at(0xE519);	// @ (0x1CA3 * 8 + 1)
#define                                 XOR17_bit           _BIT_ACCESS(CRCXORU,1)
// CRCXORU<XOR18>
extern volatile __bit                   XOR18               __at(0xE51A);	// @ (0x1CA3 * 8 + 2)
#define                                 XOR18_bit           _BIT_ACCESS(CRCXORU,2)
// CRCXORU<XOR19>
extern volatile __bit                   XOR19               __at(0xE51B);	// @ (0x1CA3 * 8 + 3)
#define                                 XOR19_bit           _BIT_ACCESS(CRCXORU,3)
// CRCXORL<XOR2>
extern volatile __bit                   XOR2                __at(0xE50A);	// @ (0x1CA1 * 8 + 2)
#define                                 XOR2_bit            _BIT_ACCESS(CRCXORL,2)
// CRCXORU<XOR20>
extern volatile __bit                   XOR20               __at(0xE51C);	// @ (0x1CA3 * 8 + 4)
#define                                 XOR20_bit           _BIT_ACCESS(CRCXORU,4)
// CRCXORU<XOR21>
extern volatile __bit                   XOR21               __at(0xE51D);	// @ (0x1CA3 * 8 + 5)
#define                                 XOR21_bit           _BIT_ACCESS(CRCXORU,5)
// CRCXORU<XOR22>
extern volatile __bit                   XOR22               __at(0xE51E);	// @ (0x1CA3 * 8 + 6)
#define                                 XOR22_bit           _BIT_ACCESS(CRCXORU,6)
// CRCXORU<XOR23>
extern volatile __bit                   XOR23               __at(0xE51F);	// @ (0x1CA3 * 8 + 7)
#define                                 XOR23_bit           _BIT_ACCESS(CRCXORU,7)
// CRCXORT<XOR24>
extern volatile __bit                   XOR24               __at(0xE520);	// @ (0x1CA4 * 8 + 0)
#define                                 XOR24_bit           _BIT_ACCESS(CRCXORT,0)
// CRCXORT<XOR25>
extern volatile __bit                   XOR25               __at(0xE521);	// @ (0x1CA4 * 8 + 1)
#define                                 XOR25_bit           _BIT_ACCESS(CRCXORT,1)
// CRCXORT<XOR26>
extern volatile __bit                   XOR26               __at(0xE522);	// @ (0x1CA4 * 8 + 2)
#define                                 XOR26_bit           _BIT_ACCESS(CRCXORT,2)
// CRCXORT<XOR27>
extern volatile __bit                   XOR27               __at(0xE523);	// @ (0x1CA4 * 8 + 3)
#define                                 XOR27_bit           _BIT_ACCESS(CRCXORT,3)
// CRCXORT<XOR28>
extern volatile __bit                   XOR28               __at(0xE524);	// @ (0x1CA4 * 8 + 4)
#define                                 XOR28_bit           _BIT_ACCESS(CRCXORT,4)
// CRCXORT<XOR29>
extern volatile __bit                   XOR29               __at(0xE525);	// @ (0x1CA4 * 8 + 5)
#define                                 XOR29_bit           _BIT_ACCESS(CRCXORT,5)
// CRCXORL<XOR3>
extern volatile __bit                   XOR3                __at(0xE50B);	// @ (0x1CA1 * 8 + 3)
#define                                 XOR3_bit            _BIT_ACCESS(CRCXORL,3)
// CRCXORT<XOR30>
extern volatile __bit                   XOR30               __at(0xE526);	// @ (0x1CA4 * 8 + 6)
#define                                 XOR30_bit           _BIT_ACCESS(CRCXORT,6)
// CRCXORT<XOR31>
extern volatile __bit                   XOR31               __at(0xE527);	// @ (0x1CA4 * 8 + 7)
#define                                 XOR31_bit           _BIT_ACCESS(CRCXORT,7)
// CRCXORL<XOR4>
extern volatile __bit                   XOR4                __at(0xE50C);	// @ (0x1CA1 * 8 + 4)
#define                                 XOR4_bit            _BIT_ACCESS(CRCXORL,4)
// CRCXORL<XOR5>
extern volatile __bit                   XOR5                __at(0xE50D);	// @ (0x1CA1 * 8 + 5)
#define                                 XOR5_bit            _BIT_ACCESS(CRCXORL,5)
// CRCXORL<XOR6>
extern volatile __bit                   XOR6                __at(0xE50E);	// @ (0x1CA1 * 8 + 6)
#define                                 XOR6_bit            _BIT_ACCESS(CRCXORL,6)
// CRCXORL<XOR7>
extern volatile __bit                   XOR7                __at(0xE50F);	// @ (0x1CA1 * 8 + 7)
#define                                 XOR7_bit            _BIT_ACCESS(CRCXORL,7)
// CRCXORH<XOR8>
extern volatile __bit                   XOR8                __at(0xE510);	// @ (0x1CA2 * 8 + 0)
#define                                 XOR8_bit            _BIT_ACCESS(CRCXORH,0)
// CRCXORH<XOR9>
extern volatile __bit                   XOR9                __at(0xE511);	// @ (0x1CA2 * 8 + 1)
#define                                 XOR9_bit            _BIT_ACCESS(CRCXORH,1)
// STATUS<ZERO>
extern volatile __bit                   ZERO                __at(0x1A);	// @ (0x3 * 8 + 2)
#define                                 ZERO_bit            _BIT_ACCESS(STATUS,2)
// SSP1STAT<nA>
extern volatile __bit                   nA                  __at(0x3C7D);	// @ (0x78F * 8 + 5)
#define                                 nA_bit              _BIT_ACCESS(SSP1STAT,5)
// SSP1STAT<nA2>
extern volatile __bit                   nA2                 __at(0x3C7D);	// @ (0x78F * 8 + 5)
#define                                 nA2_bit             _BIT_ACCESS(SSP1STAT,5)
// SSP1STAT<nADDRESS>
extern volatile __bit                   nADDRESS            __at(0x3C7D);	// @ (0x78F * 8 + 5)
#define                                 nADDRESS_bit        _BIT_ACCESS(SSP1STAT,5)
// SSP1STAT<nADDRESS1>
extern volatile __bit                   nADDRESS1           __at(0x3C7D);	// @ (0x78F * 8 + 5)
#define                                 nADDRESS1_bit       _BIT_ACCESS(SSP1STAT,5)
// PCON0<nBOR>
extern volatile __bit                   nBOR                __at(0xC90);	// @ (0x192 * 8 + 0)
#define                                 nBOR_bit            _BIT_ACCESS(PCON0,0)
// PCON1<nMEMV>
extern volatile __bit                   nMEMV               __at(0xC99);	// @ (0x193 * 8 + 1)
#define                                 nMEMV_bit           _BIT_ACCESS(PCON1,1)
// STATUS<nPD>
extern volatile __bit                   nPD                 __at(0x1B);	// @ (0x3 * 8 + 3)
#define                                 nPD_bit             _BIT_ACCESS(STATUS,3)
// PCON0<nPOR>
extern volatile __bit                   nPOR                __at(0xC91);	// @ (0x192 * 8 + 1)
#define                                 nPOR_bit            _BIT_ACCESS(PCON0,1)
// PCON0<nRI>
extern volatile __bit                   nRI                 __at(0xC92);	// @ (0x192 * 8 + 2)
#define                                 nRI_bit             _BIT_ACCESS(PCON0,2)
// PCON0<nRMCLR>
extern volatile __bit                   nRMCLR              __at(0xC93);	// @ (0x192 * 8 + 3)
#define                                 nRMCLR_bit          _BIT_ACCESS(PCON0,3)
// PCON0<nRWDT>
extern volatile __bit                   nRWDT               __at(0xC94);	// @ (0x192 * 8 + 4)
#define                                 nRWDT_bit           _BIT_ACCESS(PCON0,4)
// T1CON<nSYNC>
extern volatile __bit                   nSYNC               __at(0x1872);	// @ (0x30E * 8 + 2)
#define                                 nSYNC_bit           _BIT_ACCESS(T1CON,2)
// T1CON<nT1SYNC>
extern volatile __bit                   nT1SYNC             __at(0x1872);	// @ (0x30E * 8 + 2)
#define                                 nT1SYNC_bit         _BIT_ACCESS(T1CON,2)
// STATUS<nTO>
extern volatile __bit                   nTO                 __at(0x1C);	// @ (0x3 * 8 + 4)
#define                                 nTO_bit             _BIT_ACCESS(STATUS,4)
// SSP1STAT<nW>
extern volatile __bit                   nW                  __at(0x3C7A);	// @ (0x78F * 8 + 2)
#define                                 nW_bit              _BIT_ACCESS(SSP1STAT,2)
// SSP1STAT<nW2>
extern volatile __bit                   nW2                 __at(0x3C7A);	// @ (0x78F * 8 + 2)
#define                                 nW2_bit             _BIT_ACCESS(SSP1STAT,2)
// PCON0<nWDTWV>
extern volatile __bit                   nWDTWV              __at(0xC95);	// @ (0x192 * 8 + 5)
#define                                 nWDTWV_bit          _BIT_ACCESS(PCON0,5)
// SSP1STAT<nWRITE>
extern volatile __bit                   nWRITE              __at(0x3C7A);	// @ (0x78F * 8 + 2)
#define                                 nWRITE_bit          _BIT_ACCESS(SSP1STAT,2)
// SSP1STAT<nWRITE1>
extern volatile __bit                   nWRITE1             __at(0x3C7A);	// @ (0x78F * 8 + 2)
#define                                 nWRITE1_bit         _BIT_ACCESS(SSP1STAT,2)

#endif // _PIC16F13125_H_
